/* ============================================================================
    Autor: Julia
    Data:  Março de 2023

============================================================================ */

/* ========================================================================= */
/* --- Bibliotecas --- */
#include <stdio.h>
#include <stdlib.h>

/* ========================================================================= */
/* --- Função Principal --- */
main()
{

    float resistor1 = 10.0E3,
          resistor2 = 2.0E3,
          tensaoDeEntrada = 15.0,
          Vin;

    Vin = resistor2 * tensaoDeEntrada / (resistor1 + resistor2);

    printf("Vin = %2f\n", Vin);

    system("PAUSE");
    return 0;

} /* end main */

/* ============================================================================ */
/* --- Final do Programa --- */